--技能: BOSS大范围辅助攻击

Include("\\script\\skill\\skillfunctions.lua")

SKILL = {
	--技能属性

	SKILL_LEVEL_BASE_ATTRIB	  =	--技能等级相关基本属性
	{
	{"skill_effect_persist_time",{{1,60},{4,60},{5,60},{6,120},{7,60},{8,120},{9,120},{12,120},{13,120},{14,300},{15,120},{16,300},{17,120},{20,300}}},
	},

	SKILL_LEVEL_COST_ATTRIB	  =	--技能等级相关消耗属性
	{
	},

	SKILL_LEVEL_MISSLE_ATTRIB =	--技能等级相关子弹属性
	{
	},

	--魔法属性

	--属性值:	普通攻击力 * X + (1 + 技能等级 * Y) * (力量 * A + 根骨 * B + 身法 * C + 内功 * D + 洞察 * E)
	--			+ 武器外功攻击点 * F + Z
	--			(其中,A,B,C,D,E,F,X,Y,Z为伤害因素.除Z外,其余各伤害因素为百分比数.)

	--成功几率:	(属性值 * A + (自身等级 - 对方等级) * B + 技能等级 * C) * D + X
	--			(其中,A,B,C,D,X为几率因素.除X外,其余各几率因素为百分比数.)

	SKILL_MAGIC_DAMAGE_ATTRIB =	--技能等级相关伤害魔法属性
	{
	{magic="damage_life",
	damage_factor_x={{1,100},{8,100},{9,200},{20,200}},
	},
	},

	SKILL_MAGIC_STATE_ATTRIB  =	--技能等级相关状态魔法属性
	{
	{magic="state_slow",
	damage_factor_z={{1,40},{2,0},{3,0},{4,0},{5,30},{6,40},{7,0},{8,0},{9,60},{10,0},{11,0},{12,0},{13,50},{14,60},{15,0},{16,0},{17,40},{20,70}},
	},
	{magic="state_attack_speed_dec",
	damage_factor_z={{1,0},{2,40},{3,0},{4,0},{5,30},{6,40},{7,0},{8,0},{9,0},{10,60},{11,0},{12,0},{13,50},{14,60},{15,0},{16,0},{17,40},{20,70}},
	},
	{magic="state_burst_dec_rate",
	damage_factor_z={{1,0},{2,40},{3,0},{4,0},{5,30},{6,40},{7,0},{8,0},{9,0},{10,60},{11,0},{12,0},{13,50},{14,60},{15,0},{16,0},{17,40},{20,70}},
	},
	{magic="state_p_attack_percent_dec",
	damage_factor_z={{1,0},{2,0},{3,40},{4,0},{5,0},{6,0},{7,30},{8,40},{9,0},{10,0},{11,80},{12,0},{13,0},{14,0},{15,50},{16,60},{17,40},{20,70}},
	},
	{magic="state_m_attack_percent_dec",
	damage_factor_z={{1,0},{2,0},{3,40},{4,0},{5,0},{6,0},{7,30},{8,40},{9,0},{10,0},{11,80},{12,0},{13,0},{14,0},{15,50},{16,60},{17,40},{20,70}},
	},
	{magic="state_magic_parmor_poi_dec",
	damage_factor_z={{1,0},{2,0},{3,0},{4,30},{5,0},{6,0},{7,30},{8,40},{9,0},{10,0},{11,0},{12,80},{13,0},{14,0},{15,50},{16,60},{17,40},{20,70}},
	},
	{magic="state_physical_parmor_poi_dec",
	damage_factor_z={{1,0},{2,0},{3,0},{4,30},{5,0},{6,0},{7,30},{8,40},{9,0},{10,0},{11,0},{12,80},{13,0},{14,0},{15,50},{16,60},{17,40},{20,70}},
	},
	},

	SKILL_MAGIC_IMME_ATTRIB   =	--技能等级相关立即魔法属性
	{
	},
}
