--技能: 无上太极剑(子2)

Include("\\script\\skill\\skillfunctions.lua")

SKILL = {
	--技能属性

	SKILL_LEVEL_BASE_ATTRIB	  =	--技能等级相关基本属性
	{
	},

	SKILL_LEVEL_COST_ATTRIB	  =	--技能等级相关消耗属性
	{
	},

	SKILL_LEVEL_MISSLE_ATTRIB =	--技能等级相关子弹属性
	{
	{"skill_missle_num",{{1,3},{2,3},{3,4},{4,4},{5,5},{6,6},{7,6},{8,8},{9,8},{10,10},{11,6},{12,8},{13,8},{14,10},{15,12},{16,12},{17,15},{18,15},{19,15},{20,18}}},
	{"missle_generate_data",{{1,54},{2,54},{3,72},{4,72},{5,90},{6,54},{7,54},{8,72},{9,72},{10,90},{11,54},{12,72},{13,72},{14,90},{15,72},{16,72},{17,90},{18,90},{19,90},{20,108}}},
	{"skill_param1",{{1,20},{20,20}}},
	{"skill_param2",{{1,0},{20,0}}},
	{"missle_vanish_after_collide",{{1,1},{20,1}}},
	{"missle_damage_interval",{{1,-1},{20,-1}}},
	},

	--魔法属性

	--属性值:	普通攻击力 * X + (1 + 技能等级 * Y) * (力量 * A + 根骨 * B + 身法 * C + 内功 * D + 洞察 * E)
	--			+ 武器外功攻击点 * F + Z
	--			(其中,A,B,C,D,E,F,X,Y,Z为伤害因素.除Z外,其余各伤害因素为百分比数.)

	--成功几率:	(属性值 * A + (自身等级 - 对方等级) * B + 技能等级 * C) * D + X
	--			(其中,A,B,C,D,X为几率因素.除X外,其余各几率因素为百分比数.)

	SKILL_MAGIC_DAMAGE_ATTRIB =	--技能等级相关伤害魔法属性
	{
	{magic="damage_life_monster",
	damage_factor_z={{1,1000},{9,1800},{10,2000},{16,2400},{18,2600},{20,3000}},
	},
	},

	SKILL_MAGIC_STATE_ATTRIB  =	--技能等级相关状态魔法属性
	{
	},

	SKILL_MAGIC_IMME_ATTRIB   =	--技能等级相关立即魔法属性
	{
	{magic="imme_life_percent_damage",
	damage_factor_z={{1,5},{9,9},{10,10},{11,11},{17,13},{18,13},{20,15}},
	},
	},
}
