--技能: BOSS陷阱

Include("\\script\\skill\\skillfunctions.lua")

SKILL = {
	--技能属性

	SKILL_LEVEL_BASE_ATTRIB	  =	--技能等级相关基本属性
	{
	{"skill_effect_persist_time",{{1,9999},{20,9999}}},
	},

	SKILL_LEVEL_COST_ATTRIB	  =	--技能等级相关消耗属性
	{
	},

	SKILL_LEVEL_MISSLE_ATTRIB =	--技能等级相关子弹属性
	{
	{"skill_missle_num",{{1,99},{20,99}}},
	{"skill_missle_num1",{{1,3},{5,3},{6,5},{10,5},{11,7},{15,7},{16,10},{20,10}}},
	{"missle_param2",{{1,100},{20,100}}},
	},

	--魔法属性

	--属性值:	普通攻击力 * X + (1 + 技能等级 * Y) * (力量 * A + 根骨 * B + 身法 * C + 内功 * D + 洞察 * E)
	--			+ 武器外功攻击点 * F + Z
	--			(其中,A,B,C,D,E,F,X,Y,Z为伤害因素.除Z外,其余各伤害因素为百分比数.)

	--成功几率:	(属性值 * A + (自身等级 - 对方等级) * B + 技能等级 * C) * D + X
	--			(其中,A,B,C,D,X为几率因素.除X外,其余各几率因素为百分比数.)

	SKILL_MAGIC_DAMAGE_ATTRIB =	--技能等级相关伤害魔法属性
	{
	{magic="damage_life",
	damage_factor_z={{1,0},{2,3000},{3,0},{4,5000},{5,0},{6,0},{7,3000},{8,0},{9,5000},{10,0},{11,0},{12,3000},{13,0},{14,5000},{15,0},{16,0},{17,3000},{18,0},{19,5000},{20,0}},
	}
	},

	SKILL_MAGIC_STATE_ATTRIB  =	--技能等级相关状态魔法属性
	{
	{magic="state_poison_damage",
	damage_factor_z={{1,1000},{2,0},{3,2000},{4,0},{5,5000},{6,1000},{7,0},{8,2000},{9,0},{10,5000},{11,1000},{12,0},{13,2000},{14,0},{15,5000},{16,1000},{17,0},{18,2000},{19,0},{20,5000}},
	}
	},

	SKILL_MAGIC_IMME_ATTRIB   =	--技能等级相关立即魔法属性
	{
	},
}
