--技能: 养蛊秘术

Include("\\script\\skill\\skillfunctions.lua")

SKILL = {
	--技能属性

	SKILL_LEVEL_BASE_ATTRIB	  =	--技能等级相关基本属性
	{
	{"skill_display_persist_time",{{1,1},{10,10}}},
	},

	SKILL_LEVEL_COST_ATTRIB	  =	--技能等级相关消耗属性
	{
	{"cost_usable_id_1",{{1,0},{2,131073},{3,0},{4,131080},{5,0},{6,0},{7,0},{8,0},{9,0},{10,0}}},
	{"cost_usable_num_1",{{1,0},{2,1},{3,0},{4,1},{5,0},{6,0},{7,0},{8,0},{9,0},{10,0}}},
	{"cost_other_id_1",{{1,131073},{2,131105},{3,131105},{4,65542},{5,68904},{6,68904},{7,68904},{8,68904},{9,68904},{10,68904}}},
	{"cost_other_num_1",{{1,1},{2,1},{3,1},{4,1},{5,1},{6,2},{7,4},{8,6},{9,8},{10,10}}},
	{"cost_other_id_2",{{1,131102},{2,0},{3,65809},{4,0},{5,0},{6,0},{7,0},{8,0},{9,0},{10,0}}},
	{"cost_other_num_2",{{1,1},{2,0},{3,1},{4,0},{5,0},{6,0},{7,0},{8,0},{9,0},{10,0}}},
	},

	SKILL_LEVEL_MISSLE_ATTRIB =	--技能等级相关子弹属性
	{
	},

	--魔法属性

	--属性值:	普通攻击力 * X + (1 + 技能等级 * Y) * (力量 * A + 根骨 * B + 身法 * C + 内功 * D + 洞察 * E)
	--			+ 武器外功攻击点 * F + Z
	--			(其中,A,B,C,D,E,F,X,Y,Z为伤害因素.除Z外,其余各伤害因素为百分比数.)

	--成功几率:	(属性值 * A + (自身等级 - 对方等级) * B + 技能等级 * C) * D + X
	--			(其中,A,B,C,D,X为几率因素.除X外,其余各几率因素为百分比数.)

	SKILL_MAGIC_DAMAGE_ATTRIB =	--技能等级相关伤害魔法属性
	{
	},

	SKILL_MAGIC_STATE_ATTRIB  =	--技能等级相关状态魔法属性
	{
	},

	SKILL_MAGIC_IMME_ATTRIB   =	--技能等级相关立即魔法属性
	{
	{magic="imme_make_other_item_1",
	damage_factor_z={
	{1,290979841},
	{2,291045377},
	{3,291110913},
	{4,291176449},
	{5,291241985},
	{6,291307521},
	{7,291373057},
	{8,291438593},
	{9,291504129},
	{10,291569665}},
	},
	},
}
